/**
 * 约定常量
 */

// ID限定字符
export const ID_CHAR_SET = {
    number: '0123456789',
    letter: 'abcdefghijklmnopqrstuvwxyz',
    special: '~`!@#$%^&*()-_+=[]{};:"\',<.>/?',
};

// 转义符号列表
export const HTML_ESCAPES = {
    '&': '&amp;',
    '<': '&lt;',
    '>': '&gt;',
    '"': '&quot;',
    "'": '&#39;',
    '`': '&#96;',
};

// 反转义符号列表
export const HTML_UNESCAPES = {
    '&amp;': '&',
    '&lt;': '<',
    '&gt;': '>',
    '&quot;': '"',
    '&#39;': "'",
    '&#96;': '`',
};

/**
 * 时间常量
 */
// 时间-一天的毫秒数：86400000 = 1000 * 60 * 60 * 24
export const DAY_TIME = 864e5;
// 时间-一天的毫秒数减一
export const DAY_TIME_1 = 86399999;

/**
 * 常用正则
 */
// 正则-手机号码
export const RE_PHONE = /^(\+?0?86-?)?1[3456789]\d{9}$/;

// 正则-座机号码
export const RE_TEL = /^((\d{3,4})|\d{3,4}-)?\d{7,8}?$/;

// 正则-邮箱
export const RE_EMAIL = /^\w+([-+.]\w+)*@\w+([-.]\w+)*\.\w+([-.]\w+)*$/;

// 正则-邮政编码
export const RE_ZIP_CODE = /^[1-9]\d{5}(?!\d)$/;

// 正则-腾讯QQ号
export const RE_QQ = /^[1-9][0-9]{4,}$/;

// 正则-一代身份证号码15位
export const RE_ID_CARD_V1 = /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$/;

// 正则-二代身份证号码18位
export const RE_ID_CARD_V2 = /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$/;

// 正则-身份证号码
export const RE_ID_CARD =
    /^[1-9]\d{7}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}$|^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])((\d{4})|\d{3}[Xx])$/;

// 正则-一年12个月
export const RE_MONTH = /^(0?[1-9]|1[0-2])$/;

// 正则-一月的31天
export const RE_MONTH_DAY = /^((0?[1-9])|((1|2)[0-9])|30|31)$/;

// 正则-UUID
export const RE_UUID = /^[0-9a-zA-Z]{8}-([0-9a-zA-Z]{4}-){3}[0-9a-zA-Z]{12}$/;

// 正则-双字节字符
export const RE_DB_CHAR = /^[^x00-xff]*$/;

// 正则-汉字
export const RE_CN_CHAR = /^[\u4e00-\u9fa5]*$/;

// 正则-Base64
export const RE_BASE64 =
    /^((data:.*;)?base64,)?([0-9a-zA-Z+/]{4})*(([0-9a-zA-Z+/]{2}==)|([0-9a-zA-Z+/]{3}=))?$/;

// 正则-IPv4
export const RE_IPV4 = /^((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)$/;

// 正则-域名
export const RE_DOMAIN = /^([0-9a-z_!~*'()-]+\.)*([0-9a-z][0-9a-z-]{0,61})?[0-9a-z]\.[a-z]{2,6}$/;

// 正则-端口
export const RE_PROT =
    /^[1-9][0-9]{0,3}|[1-5][0-9]{4}|6[0-4][0-9]{3}|65[0-4][0-9]{2}|655[0-2][0-9]|6553[0-5]$/;

// 正则-URL链接后缀
export const RE_URL_SUFFIX = /^[-0-9a-zA-Z+&@#/%=~_|?!:,.;]*$/;

// 正则-IP或域名链接
export const RE_URL =
    /^(https?:)?(\/\/)?(((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)|([0-9a-z_!~*'()-]+\.)*([0-9a-z][0-9a-z-]{0,61})?[0-9a-z]\.[a-z]{2,6})(:[0-9]{1-6})?([-0-9a-zA-Z+&@#/%=~_|?!:,.;]*)?$/;

// 正则-IP URL链接
export const RE_URL_IP =
    /^(https?:)?\/\/((25[0-5]|2[0-4]\d|[01]?\d\d?)\.){3}(25[0-5]|2[0-4]\d|[01]?\d\d?)(:[0-9]{1-6})?([-0-9a-zA-Z+&@#/%=~_|?!:,.;]*)?$`/;

// 正则-URL域名链接
export const RE_URL_DOMAIN =
    /^(https?:)?\/\/([0-9a-z_!~*'()-]+\.)*([0-9a-z][0-9a-z-]{0,61})?[0-9a-z]\.[a-z]{2,6}(:[0-9]{1-6})?([-0-9a-zA-Z+&@#/%=~_|?!:,.;]*)?$`/;
